#Область ПрограммныйИнтерфейс

Процедура ОбработатьВходящееСообщение(ДанныеСообщения) Экспорт
	
	ОбъектЧтение = Новый ЧтениеJSON;
	
	Если ТипЗнч(ДанныеСообщения) = Тип("ДвоичныеДанные") Тогда
		ЧтениеДанных = Новый ЧтениеДанных(ДанныеСообщения);   
		БуферДанных = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных();   
		
		ПотокДанных = Новый ПотокВПамяти(БуферДанных);   
		ОбъектЧтение.ОткрытьПоток(ПотокДанных);
	Иначе			
		ОбъектЧтение.УстановитьСтроку(ДанныеСообщения);		
	КонецЕсли;                 
	
	Попытка
		ОбъектСериализации = СериализаторXDTO.ПрочитатьJSON(ОбъектЧтение); 
	Исключение
		// на вход может прийти и не json
		ОбъектЧтение.Закрыть();	
		Возврат;
	КонецПопытки;
	
	Если СтрНайти(ТипЗнч(ОбъектСериализации), "Справочник") > 0 Тогда 		
		ОбъектСериализации.Записать();  
	ИначеЕсли СтрНайти(ТипЗнч(ОбъектСериализации), "Документ") > 0 Тогда
		Если ОбъектСериализации.Проведен Тогда 
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		ИначеЕсли ОбъектСериализации.ПометкаУдаления Тогда 
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;	
			
		ОбъектСериализации.Записать(РежимЗаписи);  
	КонецЕсли;	
		
	ОбъектЧтение.Закрыть();	      

КонецПроцедуры

#КонецОбласти