#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(СтруктураПараметров) Экспорт
	Запись = РегистрыСведений.KFK_ОчередьДействийПослеОбмена.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураПараметров);	
	
	Если НЕ ЗначениеЗаполнено(Запись.Действие) Тогда
		Запись.Действие = Справочники.KFK_КлассификаторДействийСОбъектамиОчередиПослеОбмена.Проведение;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Запись.ИдентификаторМетаданных) И ЗначениеЗаполнено(Запись.Объект) Тогда
	//	Запись.ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(СтруктураПараметров.Объект));
	//КонецЕсли;
	
	Запись.Записать(истина);
КонецПроцедуры

Функция ВыполнитьУдалениеЗаписей(ИдентификаторЗадания, ИдентификаторыОбъектов) Экспорт
	Для каждого ИдентификаторОбъекта Из ИдентификаторыОбъектов Цикл
		НаборЗаписей = РегистрыСведений.KFK_ОчередьДействийПослеОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторОперации.Установить(ИдентификаторЗадания);
		НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторОбъекта);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;
КонецФункции

Функция ПолучитьСтруктуруЗаписи() Экспорт
	Возврат Новый Структура("Объект, Действие, ИдентификаторОперации, 
							|ИдентификаторОбъекта, НаборЗначений, 
							|ДатаОбмена, ДатаОбработки, ИдентификаторМетаданных");
КонецФункции 

#Область ПрограммноеСозданиеКоманд

//Функция ПолучитьОбъектыОбработкиОчереди() Экспорт
//	МассивОбъектов = Новый Массив;
//	Измерения = Метаданные.РегистрыСведений["ВИ_ОчередьДействийПослеОбмена"].Измерения;	
//	Для каждого Тип Из Измерения.Объект.Тип.Типы() Цикл
//		МассивОбъектов.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип));
//	КонецЦикла;
//	
//	Возврат МассивОбъектов;
//КонецФункции

#КонецОбласти //ПрограммноеСозданиеКоманд

#КонецОбласти

#КонецЕсли
