
&НаКлиенте
Процедура МетаинформацияТопика(Команда)                                         
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеТопикаНаСервере();
КонецПроцедуры                  

Процедура МетаданныеТопикаНаСервере()

	ИдентификаторВК = KFK_ИнтеграцияПовтИсп.ИдентификаторВнешнейКомпоненты();
	Компонента = KFK_Интеграция.ПодключитьКомпонентуКафка(ИдентификаторВК, ТипПодключенияВнешнейКомпоненты.Изолированно);	
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		Компонента.УстановитьПараметр(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;     
	
	Метаинформация = Компонента.ПолучитьМетаданныеТопика(Объект.Брокер.АдресБрокера, Объект.Топик)
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	Элементы.Топик.СписокВыбора.ЗагрузитьЗначения(
		KFK_ИнтеграцияВызовСервера.ЗаполнитьСписокВыбораТопиков(Объект.Брокер).ВыгрузитьЗначения());

КонецПроцедуры

&НаСервере
Процедура СоздатьТопикНаСервере()  
	
	ИдентификаторВК = KFK_ИнтеграцияПовтИсп.ИдентификаторВнешнейКомпоненты();
	Компонента = KFK_Интеграция.ПодключитьКомпонентуКафка(ИдентификаторВК, ТипПодключенияВнешнейКомпоненты.Изолированно);	
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		Компонента.УстановитьПараметр(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;     
	
	Если Компонента.СоздатьТопик(Объект.Брокер.АдресБрокера, ИмяТопикаДляСоздания, КоличествоПартиций, 1) Тогда
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Топик успешно создан");
	Иначе
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка создания топика: %1", Компонента.ПолучитьСообщениеОбОшибке()));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТопик(Команда)    
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;        
	
	Если НЕ ЗначениеЗаполнено(ИмяТопикаДляСоздания) Тогда  
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Имя топика не указано");
		Возврат;
	КонецЕсли;
	
	СоздатьТопикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьТопикНаСервере()
	ИдентификаторВК = KFK_ИнтеграцияПовтИсп.ИдентификаторВнешнейКомпоненты();
	Компонента = KFK_Интеграция.ПодключитьКомпонентуКафка(ИдентификаторВК, ТипПодключенияВнешнейКомпоненты.Изолированно);	
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		Компонента.УстановитьПараметр(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;     
	
	Если Компонента.УдалитьТопик(Объект.Брокер.АдресБрокера, ИмяТопикаДляУдаления) Тогда
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Топик успешно удален!");
	Иначе
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка удаления топика: %1", Компонента.ПолучитьСообщениеОбОшибке()));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТопик(Команда) 

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;   

	Если НЕ ЗначениеЗаполнено(ИмяТопикаДляУдаления) Тогда  
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Имя топика не указано");
		Возврат;
	КонецЕсли;
	
	
	УдалитьТопикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиТопикаНаСервере()   
	
	ИдентификаторВК = KFK_ИнтеграцияПовтИсп.ИдентификаторВнешнейКомпоненты();
	Компонента = KFK_Интеграция.ПодключитьКомпонентуКафка(ИдентификаторВК, ТипПодключенияВнешнейКомпоненты.Изолированно);	
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		Компонента.УстановитьПараметр(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;     
	
	// Получение настроек топика
	РезультатJSON = Компонента.ПолучитьНастройкиТопика(Объект.Брокер.АдресБрокера, Объект.Топик);  
	
	Если ПустаяСтрока(РезультатJSON) Тогда
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + Компонента.ПолучитьСообщениеОбОшибке());
	КонецЕсли;                                                                                     
	
	ДанныеНастроек = KFK_ОбщегоНазначения.JSONВЗначение(РезультатJSON);
	МассивНастроек = ДанныеНастроек.Получить("configs");
	
	Для Каждого Настройка Из МассивНастроек Цикл
		НС = НастройкиТопика.Добавить();
		НС.Ключ = Настройка["name"];
		НС.Значение = Настройка["value"];
		НС.Доступность = Настройка["is_read_only"];
		НС.ПоУмолчанию = Настройка["is_default"];
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПолучитьНастройкиТопика(Команда)                     
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Заполнить настройки?", Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;	                                   
	
	НастройкиТопика.Очистить();
	ПолучитьНастройкиТопикаНаСервере();       

КонецПроцедуры

&НаКлиенте
Процедура НастройкиТопикаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.НастройкиТопика.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ПредыдущееЗначение) Тогда
		ТекущиеДанные.ПредыдущееЗначение = ТекущиеДанные.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиТопикаНаСервере()
	
	ИдентификаторВК = KFK_ИнтеграцияПовтИсп.ИдентификаторВнешнейКомпоненты();
	Компонента = KFK_Интеграция.ПодключитьКомпонентуКафка(ИдентификаторВК, ТипПодключенияВнешнейКомпоненты.Изолированно);	
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		Компонента.УстановитьПараметр(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;     
	
	НастройкиJSON = Новый Соответствие; 
	Для Каждого Настройка Из НастройкиТопика Цикл
		Если ЗначениеЗаполнено(Настройка.ПредыдущееЗначение) И (Настройка.ПредыдущееЗначение <> Настройка.Значение) Тогда
			НастройкиJSON.Вставить(Настройка.Ключ, Настройка.Значение);
		КонецЕсли;
	КонецЦикла;                                                        
	
	Если НастройкиJSON.Количество() = 0 Тогда
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют измененные настройки!");
		Возврат;
	КонецЕсли;
	
	СтрокаНастройкиJSON = KFK_ОбщегоНазначения.ЗначениеВJSON(НастройкиJSON);
	
	Если Компонента.УстановитьНастройкиТопика(Объект.Брокер.АдресБрокера, Объект.Топик, СтрокаНастройкиJSON) Тогда
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройки топика успешно изменены");
	Иначе
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка изменения настроек: " + Компонента.ПолучитьСообщениеОбОшибке());
	КонецЕсли;	
	
	ПолучитьНастройкиТопикаНаСервере();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаписатьНастройкиТопика(Команда)
	
	Если НастройкиТопика.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;                       
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Заполнить настройки?", Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;	         
	
	ЗаписатьНастройкиТопикаНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКонсьюмеровНаСервере()

	ИдентификаторВК = KFK_ИнтеграцияПовтИсп.ИдентификаторВнешнейКомпоненты();
	Компонента = KFK_Интеграция.ПодключитьКомпонентуКафка(ИдентификаторВК, ТипПодключенияВнешнейКомпоненты.Изолированно);	
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		Компонента.УстановитьПараметр(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;     
	
	// Получение списка консьюмеров топика
	РезультатJSON = Компонента.ПолучитьКонсьюмеровТопика(Объект.Брокер.АдресБрокера, Объект.Топик);
	
	Если ПустаяСтрока(РезультатJSON) Тогда
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + Компонента.ПолучитьСообщениеОбОшибке());
	Иначе
		Результат = KFK_ОбщегоНазначения.JSONВЗначение(РезультатJSON);		
		
		Если Число(Результат["groups_count"]) = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Группа Из Результат["consumer_groups"] Цикл
			НС = КонсьюмерыТопика.Добавить();
			НС.Консьюмер = Группа["group_id"];		
			НС.Состояние = Группа["state"];    
			
			РезультатJSON = Компонента.ПолучитьОтставаниеКонсьюмера(Объект.Брокер.АдресБрокера, Объект.Топик, НС.Консьюмер);
			РезультатЛаг = KFK_ОбщегоНазначения.JSONВЗначение(РезультатJSON);
			НС.Лаг = РезультатЛаг["total_lag"];
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКонсьюмеров(Команда)  
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	КонсьюмерыТопика.Очистить();
	ПолучитьКонсьюмеровНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРазмерТопикаНаСервере()       
	
	ИдентификаторВК = KFK_ИнтеграцияПовтИсп.ИдентификаторВнешнейКомпоненты();
	Компонента = KFK_Интеграция.ПодключитьКомпонентуКафка(ИдентификаторВК, ТипПодключенияВнешнейКомпоненты.Изолированно);	
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		Компонента.УстановитьПараметр(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;     
	
	Метаинформация = Компонента.ПолучитьРазмерТопика(Объект.Брокер.АдресБрокера, Объект.Топик);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРазмерТопика(Команда)  
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ПолучитьРазмерТопикаНаСервере();
КонецПроцедуры
