#Область ПрограммныйИнтерфейс

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий) Экспорт  
	
	Продюсер = Константы.KFK_ОсновнойПродюсерДляРегулярнойОтправки.Получить();
	
	Если НЕ ЗначениеЗаполнено(Продюсер) Тогда
		Возврат;
	КонецЕсли;
	
	Версия = ИнформацияОЗаписиВерсий[ИнформацияОЗаписиВерсий.Количество()-1];  
	СсылкаНаОбъект = Версия.Данные;   

	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	// Выполнить запись данных (Объект) с помощью объекта записи (Запись).
	СериализаторXDTO.ЗаписатьJSON(Запись, СсылкаНаОбъект.ПолучитьОбъект(), НазначениеТипаXML.Явное);

	СтрокаJSON = Запись.Закрыть();  
	
	ПараметрыПубликации = Новый Структура("Параметры", Новый Структура);
	KFK_Интеграция.Опубликовать(Продюсер, СтрокаJSON, ПараметрыПубликации);
	
КонецПроцедуры        

#КонецОбласти