
&НаКлиенте
Асинх Процедура СсылкаВнешнейКомпонентыНажатие(Элемент)
	ЗапуститьПриложениеАсинх("https://github.com/NuclearAPK/Simple-Kafka_Adapter");
КонецПроцедуры

&НаКлиенте
Асинх Процедура СсылкаTelegramНажатие(Элемент)
	ЗапуститьПриложениеАсинх("https://t.me/NuclearShmell");
КонецПроцедуры

&НаКлиенте
Асинх Процедура Декорация2Нажатие(Элемент)
	ЗапуститьПриложениеАсинх("https://github.com/kuzyara/JobsConsole2019.epf");
КонецПроцедуры

&НаКлиенте
Асинх Процедура Декорация4Нажатие(Элемент)
	ЗапуститьПриложениеАсинх("https://v8.1c.ru/tekhnologii/standartnye-biblioteki/1s-biblioteka-standartnykh-podsistem/");
КонецПроцедуры

&НаКлиенте
Асинх Процедура СсылкаПочтаНажатие(Элемент)
	ЗапуститьПриложениеАсинх("mailto:vadimshmelev83@gmail.com");
КонецПроцедуры

&НаКлиенте
Процедура Декорация5Нажатие(Элемент)
	ЗапуститьПриложениеАсинх("https://github.com/vbondarevsky/Connector");
КонецПроцедуры
