#Область ПрограммныйИнтерфейс

Функция ИдентификаторВнешнейКомпоненты() Экспорт

	Возврат KFK_Интеграция.ИдентификаторВнешнейКомпоненты();

КонецФункции

Функция ИмяСобытияКонсьюмер() Экспорт
    Возврат KFK_Интеграция.ИмяСобытияКонсьюмер();
КонецФункции               

Функция ИмяСобытияПродюсер() Экспорт
    Возврат KFK_Интеграция.ИмяСобытияПродюсер();
КонецФункции       

Функция ТаймаутОжиданияПоУмолчанию() Экспорт
	Возврат KFK_Интеграция.ТаймаутОжиданияПоУмолчанию();	
КонецФункции

#КонецОбласти //ПрограммныйИнтерфейс