#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Идентификатор) Экспорт
	
	Набор = РегистрыСведений.ВИ_ЗаданияКОбработкеОчереди.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторОперации.Установить(Идентификатор);   
	Набор.Прочитать();
	Набор.Очистить();
	
	Запись = Набор.Добавить();
	Запись.ИдентификаторОперации = Идентификатор;  
	Запись.ДатаРегистрации = ТекущаяДатаСеанса();
	Запись.Статус = Перечисления.ВИ_СтатусыЗаданийОбработкиОчереди.ОжидаетОбработки;
	
	Набор.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьИнформациюОВыполненииЗадания(Идентификатор) Экспорт   
	
	Набор = РегистрыСведений.ВИ_ЗаданияКОбработкеОчереди.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторОперации.Установить(Идентификатор);   
	Набор.Прочитать(); 
	
	Для каждого Запись Из Набор Цикл
		Запись.Статус = Перечисления.ВИ_СтатусыЗаданийОбработкиОчереди.Завершено;
	КонецЦикла;         
	
	Набор.Записать();                 

КонецПроцедуры

#КонецОбласти //ПрограммныйИнтерфейс

#КонецЕсли