#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписьОНачалеВыполненияФоновогоЗадания(Идентификатор, ВидОбработки) Экспорт  
	
	НаборЗаписейФоновогоЗадания = РегистрыСведений.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.СоздатьНаборЗаписей();
	НаборЗаписейФоновогоЗадания.Отбор.УникальныйИдентификаторФоновогоЗадания.Установить(Новый УникальныйИдентификатор(Идентификатор));
	НаборЗаписейФоновогоЗадания.Прочитать();
	
	ТекущаяДатаЗаписи = ТекущаяДата();
	
	Если НаборЗаписейФоновогоЗадания.Количество() = 0 Тогда      
		
		Запись = НаборЗаписейФоновогоЗадания.Добавить();
		Запись.Период = ТекущаяДатаЗаписи;
		Запись.УникальныйИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор(Идентификатор);
		Запись.ВидОбработкиОчереди = ВидОбработки;
		Запись.Состояние = Перечисления.KFK_РезультатыВыполненияРегламентныхЗаданий.Выполняется;
		Запись.ДатаНачала = ТекущаяДатаЗаписи;  
		Запись.ВидОбработкиОчереди = ВидОбработки;
		
		НаборЗаписейФоновогоЗадания.Записать(ложь);       
		
	КонецЕсли;        
	
КонецПроцедуры

Процедура ЗафиксироватьИнформациюОВыполненииФоновогоЗадания(Идентификатор, РегламентнаяОперация, ИнформацияОбОшибке = "") Экспорт
	
	Если Идентификатор = Неопределено ИЛИ Идентификатор = "" Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейФоновогоЗадания = РегистрыСведений.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.СоздатьНаборЗаписей();
	НаборЗаписейФоновогоЗадания.Отбор.УникальныйИдентификаторФоновогоЗадания.Установить(Новый УникальныйИдентификатор(Идентификатор));
	НаборЗаписейФоновогоЗадания.Прочитать();
	
	Если НаборЗаписейФоновогоЗадания.Количество() Тогда
		Запись = НаборЗаписейФоновогоЗадания[0];
		Запись.Состояние = ?(ИнформацияОбОшибке = "",
							 Перечисления.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.Выполнено,
							 Перечисления.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.ВыполненоСОшибками);
		Запись.ДатаОкончания = ТекущаяДатаСеанса();
		Запись.ИнформацияОбОшибке = ИнформацияОбОшибке;
	КонецЕсли;
	
	НаборЗаписейФоновогоЗадания.Записать(истина);    
	
КонецПроцедуры           

Функция ЕстьАктивнаяОбработкаОчереди(Идентификатор) Экспорт
	
	Результат = Ложь;    
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВИ_ФоновыеЗаданияОбменов.УникальныйИдентификаторФоновогоЗадания КАК УникальныйИдентификаторФоновогоЗадания
	               |ИЗ
	               |	РегистрСведений.KFK_ИсторияВыполненияЗаданийОбработкиОчереди КАК ВИ_ФоновыеЗаданияОбменов
	               |ГДЕ
	               |	ВИ_ФоновыеЗаданияОбменов.УникальныйИдентификаторФоновогоЗадания = &Идентификатор
	               |	И ВИ_ФоновыеЗаданияОбменов.Состояние = &Состояние";   

	Запрос.УстановитьПараметр("Идентификатор", Новый УникальныйИдентификатор(Идентификатор));
	Запрос.УстановитьПараметр("Состояние", Перечисления.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.Выполняется);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = истина;
	КонецЕсли;
	
	Возврат Результат;		
	
КонецФункции

#КонецОбласти

#КонецЕсли
