#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
		И Параметры.ЗначенияЗаполнения.Свойство("Объект")
		И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Объект) Тогда
		
		Запись.ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Параметры.ЗначенияЗаполнения.Объект));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти //ОбработчикиСобытийФормы

