#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	
КонецПроцедуры            

#КонецОбласти   

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СохранитьДанныеСообщения(Команда)    
	
	АдресФайла = ОбработатьПомещениеФайла();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыДиалога.Заголовок = "Укажите куда сохранить файл";
	
	Если ЗначениеЗаполнено(Запись.Ключ) Тогда
		ИмяФайла = СтрШаблон("%1 offset-%2 partition-%3 key-%4.bin", Запись.Топик, Запись.Смещение, Запись.Раздел, Запись.Ключ); 
	Иначе
		ИмяФайла = СтрШаблон("%1 offset-%2 partition-%3.bin", Запись.Топик, Запись.Смещение, Запись.Раздел); 		
	КонецЕсли;
	
	Результат = Ждать ПолучитьФайлССервераАсинх(АдресФайла, ИмяФайла, ПараметрыДиалога); 	
	
	Если Результат = Неопределено Тогда
		УдалитьИзВременногоХранилища(АдресФайла);	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Функция ОбработатьПомещениеФайла()
	
	Об = РеквизитФормыВЗначение("Запись");

	Возврат ПоместитьВоВременноеХранилище(Об.Сообщение.Получить());
	
КонецФункции

#КонецОбласти
