#Область ПрограммныйИнтерфейс

Асинх Функция ПодключитьКомпонентуКафка(ИмяКомпоненты, ТипПодключения = Неопределено) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ТипПодключения) Тогда
		ТипПодключения = ТипПодключенияВнешнейКомпоненты.Изолированно;	
	КонецЕсли; 

	Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх("ОбщийМакет.KFK_Компонента", ИмяКомпоненты, ТипВнешнейКомпоненты.Native, ТипПодключения);  
	
	Если НЕ Подключено Тогда
	    Ждать УстановитьВнешнююКомпонентуАсинх(
	        "ОбщийМакет.KFK_Компонента");
	    Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх(
	        "ОбщийМакет.KFK_Компонента", ИмяКомпоненты, ТипВнешнейКомпоненты.Native, ТипПодключения);		
	КонецЕсли;      
	
	Возврат Подключено;
	
КонецФункции

Функция ПолучитьПараметрыСинхроннойОтправки() Экспорт
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("queue.buffering.max.ms", "1");
	Параметры.Вставить("socket.blocking.max.ms", "1");  
	Параметры.Вставить("message.timeout.ms", "5000"); // с этим параметром поакуратнее	
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыОтключенияАвтофиксацииСмещений() Экспорт  
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("enable.auto.commit", "false");
	Параметры.Вставить("enable.auto.offset.store", "false");  
	Параметры.Вставить("enable.partition.eof", "false"); 	
	
	Возврат Параметры;
			
КонецФункции

#КонецОбласти //ПрограммныйИнтерфейс