#Область ПрограммныйИнтерфейс

Асинх Функция ПодключитьКомпонентуКафка(ИмяКомпоненты, ТипПодключения = Неопределено) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ТипПодключения) Тогда
		ТипПодключения = ТипПодключенияВнешнейКомпоненты.Изолированно;	
	КонецЕсли; 
	
	Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх("ОбщийМакет.KFK_Компонента", ИмяКомпоненты, ТипВнешнейКомпоненты.Native, ТипПодключения);  
	//Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх("C:\Sources\Projects\Simple-Kafka_Adapter\out\build\x64-Release\Release\SimpleKafka1C.dll",
	//											ИмяКомпоненты, ТипВнешнейКомпоненты.Native, ТипПодключения);
	
	Если НЕ Подключено Тогда
	    Ждать УстановитьВнешнююКомпонентуАсинх(
	        "ОбщийМакет.KFK_Компонента");
	    Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх(
	        "ОбщийМакет.KFK_Компонента", ИмяКомпоненты, ТипВнешнейКомпоненты.Native, ТипПодключения);		
	КонецЕсли;      
	
	Возврат Подключено;
	
КонецФункции

#КонецОбласти //ПрограммныйИнтерфейс